EDT/УТ/src/Documents/мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ/мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ</name>
  <comment>(Миго-групп)</comment>
  <registerRecords>InformationRegister.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДанныхДляРасчетаФОТ</name>
    <type>
      <types>CatalogRef.мгИсточникиДанныхДляРасчетаФОТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеСотрудников</name>
    <attributes>
      <name>ФИОСотрудника</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТабельныйНомерВИсточнике</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ/мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ</name>
  <comment>(Миго-Групп)</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТабельныйНомерВИсточнике</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИсточникДанныхДляРасчетаФОТ</name>
    <type>
      <types>CatalogRef.мгИсточникиДанныхДляРасчетаФОТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ
	Движения.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Записывать = Истина;
	Движения.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Очистить();
	Для Каждого ТекСтрокаСоответствиеСотрудников Из СоответствиеСотрудников Цикл
		Движение = Движения.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Добавить();
		Движение.ИсточникДанныхДляРасчетаФОТ = ИсточникДанныхДляРасчетаФОТ;
		Движение.Сотрудник = ТекСтрокаСоответствиеСотрудников.ФИОСотрудника;
		Движение.ТабельныйНомерВИсточнике = ТекСтрокаСоответствиеСотрудников.ТабельныйНомерВИсточнике;
		Движение.Организация = Организация;
	КонецЦикла;
КонецПроцедуры
